
/***************************************************************************
	全局变量
***************************************************************************/


$(function(){
	
	/***************************************************************************
	 * 绑定事件
	 **************************************************************************/
	//当用户双击某药品条目时,选择此药品
	$(".mode-item").on("dblclick", function() {		
		
		//用于根据ID查询当前药品的属性值.
		var modeId=$(this).attr("mode-id");		
		//设置用法文本框
		$("#drugmode").val($("#modename-"+modeId).text());
		
		//当选择一个药品后
		Common.hideDropdownTable();  //关闭选择下拉框		
		$("#drugtimes").focus();     //"给药次数"文本框获取焦点		
		
	});
});