/***************************************************************************
	全局变量
***************************************************************************/


$(function(){
	
	/***************************************************************************
	 * 绑定事件
	 **************************************************************************/
	//当用户双击某药品条目时,选择此药品
	$(".doseunit-item").on("dblclick", function() {		
		
		//用于根据ID查询当前药品的属性值.
		var doseUnitId=$(this).attr("doseunit-id");		
		//设置用法文本框
		var dosename=$("#doseunitname-"+doseUnitId).text();
		$("#"+g_edit_doseunit_id).val(dosename);
		
		//当选择一个剂量单位后
		Common.hideDropdownUnit();  //关闭选择下拉框		
				
		
	});
});